## ETL process

In this notebook, we go through the etl process, yada yada yada

Creating the database based on the ERD tables

## Creating our Databse Tables from Our ERD

In [1]:
import pandas as pd
import numpy as np
import sqlite3
import numpy as np
conn = sqlite3.connect('CourseData.db')
c = conn.cursor()

In [2]:
%load_ext sql

In [3]:
%%sql

sqlite:///CourseData.db

'Connected: @CourseData.db'

creating the separate tables.

Creating Programs Table

In [4]:
%%sql
DROP TABLE IF EXISTS PROGRAMS;

CREATE TABLE PROGRAMS ( 
    PID INTEGER PRIMARY KEY,
    PROGRAMCODE TEXT NOT NULL,
    PROGRAMNAME TEXT NOT NULL
);

 * sqlite:///CourseData.db
Done.
Done.

[]

Creating Faculty Table

In [5]:
%%sql
DROP TABLE IF EXISTS FACULTY;
CREATE TABLE FACULTY ( 
    FID INTEGER PRIMARY KEY,
    LNAME TEXT NOT NULL,
    FNAME TEXT NOT NULL
);

 * sqlite:///CourseData.db
Done.
Done.

[]

Creating the Location Table

In [6]:
%%sql
DROP TABLE IF EXISTS LOCATION;

CREATE TABLE LOCATION ( 
    LID INTEGER PRIMARY KEY,
    BUILDING TEXT,
    ROOM TEXT,
    LOCATION TEXT
);

 * sqlite:///CourseData.db
Done.
Done.

[]

Creating the Course Table

In [7]:
%%sql
DROP TABLE IF EXISTS COURSE;
CREATE TABLE COURSE ( 
    CID INTEGER PRIMARY KEY,
    PID INTEGER NOT NULL,
    EFFECTIVETERM TEXT NOT NULL,
    CATALOG_ID TEXT NOT NULL,
    COURSE_TITLE TEXT NOT NULL,
    CREDITS TEXT NOT NULL,
    PREREQS TEXT,
    COREQS TEXT,
    FEES REAL,
    ATTRIBUTES TEXT,
    DESCRIPTION TEXT,
    FOREIGN KEY (PID) REFERENCES PROGRAMS (PID)
);

 * sqlite:///CourseData.db
Done.
Done.

[]

Creating teh Course_Offering Table

In [8]:
%%sql
DROP TABLE IF EXISTS COURSE_OFFERING;
CREATE TABLE COURSE_OFFERING ( 
    COID INTEGER PRIMARY KEY,
    CID INTEGER,
    FID INTEGER NOT NULL,
    CRN TEXT NOT NULL,
    SEMESTER TEXT NOT NULL,
    YEAR INTEGER NOT NULL,
    TITLE TEXT NOT NULL,
    CATALOG_ID TEXT,
    TERM TEXT,
    EffectiveTerm TEXT,
    MEETINGS TEXT,
    TIMECODES TEXT,
    SECTION TEXT NOT NULL,
    CAP INTEGER NOT NULL,
    ACT INTEGER NOT NULL,
    REM INTEGER NOT NULL,
    LNAME TEXT,
    FNAME TEXT,
    FOREIGN KEY (CID) REFERENCES COURSE (CID)
    FOREIGN KEY (FID) REFERENCES FACULTY (FID)
);

 * sqlite:///CourseData.db
Done.
Done.

[]

Creating the Class_Meetings Table

In [9]:
%%sql
DROP TABLE IF EXISTS CLASS_MEETINGS;
CREATE TABLE CLASS_MEETINGS ( 
    CMID INTEGER PRIMARY KEY,
    COID INTEGER,
    LID INTEGER,
    DAY TEXT,
    START TEXT,
    END TEXT,
    CRN TEXT,
    TERM TEXT,
    FOREIGN KEY (LID) REFERENCES LOCATION (LID)
    FOREIGN KEY (COID) REFERENCES COURSE_OFFERING (COID)
);

 * sqlite:///CourseData.db
Done.
Done.

[]

In [10]:
%%sql 

DROP TABLE IF EXISTS CATALOG_YEAR;
CREATE TABLE CATALOG_YEAR (
    EFFECTIVETERM TEXT,
    YEAR TEXT,
    SEMESTER TEXT
);

INSERT INTO CATALOG_YEAR (Semester,Year,EffectiveTerm) VALUES 
('Fall','2014','2014-2015'),('Winter','2015','2014-2015'),('Spring','2015','2014-2015'),('Summer','2015','2014-2015'),
('Fall','2015','2015-2016'),('Winter','2016','2015-2016'),('Spring','2016','2015-2016'),('Summer','2016','2015-2016'),
('Fall','2016','2016-2017'),('Winter','2017','2016-2017'),('Spring','2017','2016-2017'),('SpringBreak','2017','2016-2017'),('Summer','2017','2016-2017'),
('Fall','2017','2017-2018'),('Winter','2018','2017-2018'),('Spring','2018','2017-2018'),('Summer','2018','2017-2018'),
('Fall','2018','2018-2019'),('Winter','2019','2018-2019'),('Spring','2019','2018-2019');

 * sqlite:///CourseData.db
Done.
Done.
20 rows affected.

[]

## Make and Populate our IMPORT tables from our CSV Files

In [11]:
%%sql 

SELECT * FROM CATALOG_YEAR;

 * sqlite:///CourseData.db
Done.

[('2014-2015', '2014', 'Fall'),
 ('2014-2015', '2015', 'Winter'),
 ('2014-2015', '2015', 'Spring'),
 ('2014-2015', '2015', 'Summer'),
 ('2015-2016', '2015', 'Fall'),
 ('2015-2016', '2016', 'Winter'),
 ('2015-2016', '2016', 'Spring'),
 ('2015-2016', '2016', 'Summer'),
 ('2016-2017', '2016', 'Fall'),
 ('2016-2017', '2017', 'Winter'),
 ('2016-2017', '2017', 'Spring'),
 ('2016-2017', '2017', 'SpringBreak'),
 ('2016-2017', '2017', 'Summer'),
 ('2017-2018', '2017', 'Fall'),
 ('2017-2018', '2018', 'Winter'),
 ('2017-2018', '2018', 'Spring'),
 ('2017-2018', '2018', 'Summer'),
 ('2018-2019', '2018', 'Fall'),
 ('2018-2019', '2019', 'Winter'),
 ('2018-2019', '2019', 'Spring')]

In [12]:
%%sql

DROP TABLE IF EXISTS IMPORT_Courses;
DROP TABLE IF EXISTS IMPORT_Course_Meetings;
DROP TABLE IF EXISTS IMPORT_CourseCatlog;
DROP TABLE IF EXISTS IMPORT_Course_Catalog;

CREATE TABLE IMPORT_Courses (
    term TEXT,
    crn TEXT,
    catalog_id TEXT,
    section TEXT,
    credits TEXT,
    title TEXT,
    meetings TEXT,
    timecodes TEXT,
    primary_instructor TEXT,
    cap INT,
    act INT, 
    rem INT,
    fname TEXT,
    lname TEXT,
    semester TEXT,
    year TEXT
);


CREATE TABLE IMPORT_Course_Meetings(
    crn TEXT,
    location TEXT,
    day TEXT,
    start TEXT,
    end TEXT,
    term TEXT, 
    building TEXT, 
    room TEXT
);

CREATE TABLE IMPORT_Course_Catalog(
    program_code TEXT,
    program_name TEXT,
    catalog_ID TEXT,
    course_title TEXT,
    credits TEXT,
    prereqs TEXT,
    coreqs TEXT,
    fees TEXT,
    attributes TEXT,
    description TEXT,
    EffectiveTerm TEXT
);

 * sqlite:///CourseData.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [13]:
folder_names = ['Fall2014', 'Fall2015', 'Fall2016', 'Fall2017', 'Fall2018', 'Spring2015', 'Spring2016', 'Spring2017', 'Spring2018',
               'Spring2019', 'SpringBreak2017', 'Summer2015', 'Summer2016', 'Summer2017', 'Summer2018', 'Winter2015', 'Winter2016', 
               'Winter2017', 'Winter2018']


for file in folder_names:
    data = 'SourceData/' + file + '/course_meetings.csv'
    
    if (file == folder_names[0]):
        df = pd.read_csv(data)
    else:
        df = df.append(pd.read_csv(data), ignore_index=True)
    
    
    location = list(df.location)
    building = []
    room = []

    for loc in location:
        loc = loc.strip("\n ' '")
        data = loc.split(' ')

        length = len(data)

        if length == 2:
            building.append(data[0])
            room.append(data[1])
        else:
            building.append(data[0])
            room.append('NULL')


    df['building'] = building

    df['room'] = room
    
df.to_sql('IMPORT_Course_Meetings', conn, if_exists='append', index=False)

/opt/tljh/user/lib/python3.6/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

In [14]:
%%sql

SELECT COUNT() FROM IMPORT_Course_Meetings;

 * sqlite:///CourseData.db
Done.

[(317321,)]

In [15]:
folder_names = ['Fall2014', 'Fall2015', 'Fall2016', 'Fall2017', 'Fall2018', 'Spring2015', 'Spring2016', 'Spring2017', 'Spring2018',
               'Spring2019', 'SpringBreak2017', 'Summer2015', 'Summer2016', 'Summer2017', 'Summer2018', 'Winter2015', 'Winter2016', 
               'Winter2017', 'Winter2018']


for file in folder_names:
    data = 'SourceData/' + file + '/courses.csv'
    
    if (file == folder_names[0]):
        df = pd.read_csv(data)
    else:
        df = df.append(pd.read_csv(data), ignore_index=True)
        
        
        
    
    instructor = list(df.primary_instructor)
    lname = []
    fname = []

    for name in instructor:
        data = name.split('  ')

        length = len(data)

        if length == 2:
            fname.append(data[0])
            lname.append(data[1])
        else:
            fname.append('TBA')
            lname.append('TBA')


    df['fname'] = fname

    df['lname'] = lname
    
    
    term = list(df.term)
    semester = []
    year = []
    

    for t in term:
        data = t.split('2')
        semester.append(data[0])
        year_val = '2'+data[1]
        year.append(year_val)
        
    df['semester'] = semester
    df['year'] = year

df.to_sql('IMPORT_Courses', conn, if_exists='append', index=False)

/opt/tljh/user/lib/python3.6/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

In [16]:
%%sql
SELECT * FROM IMPORT_COURSES LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Fall2014', '70384', 'AC 0011', 'C01', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31, 'Michael P.', 'Coyne', 'Fall', '2014'),
 ('Fall2014', '70385', 'AC 0011', 'C02', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0930am-1045am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31, 'Michael P.', 'Coyne', 'Fall', '2014'),
 ('Fall2014', '70382', 'AC 0011', 'C03', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 1230pm-0145pm 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31, 'Michael P.', 'Coyne', 'Fall', '2014'),
 ('Fall2014', '70291', 'AC 0011', 'C04', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1100am-1215pm 09/02-12/08 DSB 111']", 'Rebecca I.  Bloch', 0, 29, -29, 'Rebecca I.', 'Bloch', 'Fall', '2014'),
 ('Fall2014', '70350', 'AC 0011', 'C05', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1230pm-0145pm 09/02-12/08 DSB 111']", 'Rebecca I.  Bloch', 0, 30, -30, 'Rebecca I.', 'Bloch', 'Fall', '2014'),
 ('Fall2014', '70381', 'AC 0011', 'C06', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '0330pm-0445pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['MR 0330pm-0445pm 09/02-12/08 DSB 110A']", 'Rebecca I.  Bloch', 0, 31, -31, 'Rebecca I.', 'Bloch', 'Fall', '2014'),
 ('Fall2014', '70383', 'AC 0011', 'G', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 0930am-1045am 09/02-12/08 DSB 111']", 'Paul   Caster', 30, 31, -1, 'Paul', ' Caster', 'Fall', '2014'),
 ('Fall2014', '70391', 'AC 0011', 'H', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['TF 0930am-1045am 09/02-12/08 DSB 110A']", 'Jo Ann   Drusbosky', 30, 32, -2, 'Jo Ann', ' Drusbosky', 'Fall', '2014'),
 ('Fall2014', '71105', 'AC 0011', 'I', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['TF 1100am-1215pm 09/02-12/08 DSB 110A']", 'Jo Ann   Drusbosky', 30, 33, -3, 'Jo Ann', ' Drusbosky', 'Fall', '2014'),
 ('Fall2014', '71123', 'AC 0011', 'J', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0200pm-0315pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0200pm-0315pm 09/02-12/08 DSB 105']", 'Jo Ann   Drusbosky', 30, 32, -2, 'Jo Ann', ' Drusbosky', 'Fall', '2014')]

In [17]:
folder_names = ['SourceData/Catalogs/CourseCatalog2017_2018.csv', 'SourceData/Catalogs/CourseCatalog2018_2019.csv']

df1 = pd.read_csv(folder_names[0])

df1['EffectiveTerm'] = 'NaN'

df1['EffectiveTerm'] = df1['EffectiveTerm'].replace('NaN', '2017-2018')

df2 = pd.read_csv(folder_names[1])

df2['EffectiveTerm'] = 'NaN'

df2['EffectiveTerm'] = df2['EffectiveTerm'].replace('NaN', '2018-2019')

df3 = df1.append(df2, ignore_index=True)


    
df3.to_sql('IMPORT_Course_Catalog', conn, if_exists='append', index=False)

## Populate the ERD Tables from Our Imported Data

In [18]:
%%sql
INSERT INTO PROGRAMS (ProgramCode,ProgramName) 
SELECT DISTINCT program_code,program_name
FROM IMPORT_COURSE_CATALOG;

 * sqlite:///CourseData.db
87 rows affected.

[]

In [19]:
%%sql

SELECT * FROM PROGRAMS
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'AN', 'Asian Studies'),
 (2, 'BU', 'Business'),
 (3, 'BL', 'Black Studies'),
 (4, 'BEN', 'Bioengineering'),
 (5, 'AR', 'Arabic'),
 (6, 'AY', 'Anthropology'),
 (7, 'AS', 'American Studies'),
 (8, 'JA', 'Japanese'),
 (9, 'AH', 'Art History'),
 (10, 'AE', 'Applied Ethics')]

In [20]:
%%sql
INSERT INTO FACULTY (LName,FName)
SELECT DISTINCT LName, FName
FROM IMPORT_COURSES;

 * sqlite:///CourseData.db
1096 rows affected.

[]

In [21]:
%%sql
INSERT INTO LOCATION (Building,Room,Location) 
SELECT DISTINCT building,room,location
FROM IMPORT_COURSE_MEETINGS;

 * sqlite:///CourseData.db
207 rows affected.

[]

In [22]:
%%sql
INSERT INTO COURSE (PID,EffectiveTerm,Catalog_ID,Course_Title,Credits,Prereqs,Coreqs,Fees,Attributes,Description)
SELECT DISTINCT PID,EffectiveTerm,Catalog_ID,Course_Title,Credits,Prereqs,Coreqs,Fees,Attributes,Description
FROM IMPORT_COURSE_CATALOG
    JOIN PROGRAMS ON (PROGRAMS.PROGRAMCODE=IMPORT_COURSE_CATALOG.program_code);

 * sqlite:///CourseData.db
4423 rows affected.

[]

In [23]:
%%sql

SELECT PID, Catalog_ID FROM COURSE
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'AN 0301'),
 (1, 'AN 0310'),
 (2, 'BU 0211'),
 (2, 'BU 0220'),
 (2, 'BU 0311'),
 (2, 'BU 0312'),
 (2, 'BU 0320'),
 (2, 'BU 0391'),
 (3, 'BL 0101'),
 (3, 'BL 0398')]

In [24]:
%%sql 

SELECT COUNT(credits) FROM IMPORT_Courses;

 * sqlite:///CourseData.db
Done.

[(15937,)]

In [25]:
%%sql
INSERT INTO COURSE_OFFERING (CID,FID,CRN,Semester,Year,Title,Catalog_ID,Term,EffectiveTerm,Meetings,Timecodes,Section,Cap,Act,Rem,lname,fname)
SELECT DISTINCT CID,FID,CRN,Semester,Year,Title,Catalog_ID,Term,EffectiveTerm,Meetings,Timecodes,Section,Cap,Act,Rem,lname,fname
FROM IMPORT_COURSES
    LEFT JOIN CATALOG_YEAR USING (Semester, Year)
    LEFT JOIN COURSE USING (EffectiveTerm, Catalog_ID)
    JOIN FACULTY USING (lname, fname);

 * sqlite:///CourseData.db
15937 rows affected.

[]

In [26]:
%%sql 

SELECT * FROM COURSE_OFFERING LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, None, 1, '70384', 'Fall', 2014, 'Introduction to Financial Accounting', 'AC 0011', 'Fall2014', '2014-2015', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'C01', 0, 31, -31, 'Coyne', 'Michael P.'),
 (2, None, 1, '70385', 'Fall', 2014, 'Introduction to Financial Accounting', 'AC 0011', 'Fall2014', '2014-2015', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0930am-1045am 09/02-12/08 DSB 105']", 'C02', 0, 31, -31, 'Coyne', 'Michael P.'),
 (3, None, 1, '70382', 'Fall', 2014, 'Introduction to Financial Accounting', 'AC 0011', 'Fall2014', '2014-2015', "[{'days': 'TF', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 1230pm-0145pm 09/02-12/08 DSB 105']", 'C03', 0, 31, -31, 'Coyne', 'Michael P.'),
 (4, None, 2, '70291', 'Fall', 2014, 'Introduction to Financial Accounting', 'AC 0011', 'Fall2014', '2014-2015', "[{'days': 'MR', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1100am-1215pm 09/02-12/08 DSB 111']", 'C04', 0, 29, -29, 'Bloch', 'Rebecca I.'),
 (5, None, 2, '70350', 'Fall', 2014, 'Introduction to Financial Accounting', 'AC 0011', 'Fall2014', '2014-2015', "[{'days': 'MR', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1230pm-0145pm 09/02-12/08 DSB 111']", 'C05', 0, 30, -30, 'Bloch', 'Rebecca I.'),
 (6, None, 2, '70381', 'Fall', 2014, 'Introduction to Financial Accounting', 'AC 0011', 'Fall2014', '2014-2015', "[{'days': 'MR', 'times': '0330pm-0445pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['MR 0330pm-0445pm 09/02-12/08 DSB 110A']", 'C06', 0, 31, -31, 'Bloch', 'Rebecca I.'),
 (7, None, 3, '70383', 'Fall', 2014, 'Introduction to Financial Accounting', 'AC 0011', 'Fall2014', '2014-2015', "[{'days': 'MR', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 0930am-1045am 09/02-12/08 DSB 111']", 'G', 30, 31, -1, ' Caster', 'Paul'),
 (8, None, 4, '70391', 'Fall', 2014, 'Introduction to Financial Accounting', 'AC 0011', 'Fall2014', '2014-2015', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['TF 0930am-1045am 09/02-12/08 DSB 110A']", 'H', 30, 32, -2, ' Drusbosky', 'Jo Ann'),
 (9, None, 4, '71105', 'Fall', 2014, 'Introduction to Financial Accounting', 'AC 0011', 'Fall2014', '2014-2015', "[{'days': 'TF', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['TF 1100am-1215pm 09/02-12/08 DSB 110A']", 'I', 30, 33, -3, ' Drusbosky', 'Jo Ann'),
 (10, None, 4, '71123', 'Fall', 2014, 'Introduction to Financial Accounting', 'AC 0011', 'Fall2014', '2014-2015', "[{'days': 'TF', 'times': '0200pm-0315pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0200pm-0315pm 09/02-12/08 DSB 105']", 'J', 30, 32, -2, ' Drusbosky', 'Jo Ann')]

In [27]:
%%sql

SELECT COUNT(*) FROM LOCATION;

 * sqlite:///CourseData.db
Done.

[(207,)]

In [28]:
%%sql 
INSERT INTO CLASS_MEETINGS (COID,LID,CRN,Day,Start,End,Term)
SELECT DISTINCT COURSE_OFFERING.COID,LOCATION.LID,COURSE_OFFERING.CRN,Day,Start,End,COURSE_OFFERING.Term
FROM IMPORT_COURSE_MEETINGS
    JOIN COURSE_OFFERING USING (CRN)
    JOIN LOCATION USING (Building,Room);

 * sqlite:///CourseData.db
429575 rows affected.

[]

In [29]:
%%sql
DROP TABLE IMPORT_COURSE_MEETINGS;
DROP TABLE IMPORT_COURSES;
DROP TABLE IMPORT_COURSE_CATALOG;

 * sqlite:///CourseData.db
Done.
Done.
Done.

[]

In [30]:
c.close()
del c
conn.close()